#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "528950dc2b9b80e965456f1c65663671" -> "dbf05e7c03c6101728feb096045746e2"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "5414b4d2b33ec86800ebdaaf5e52ca32" -> "52d1a1d797afbf84c0066f1fcba07d28"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "7e508288b5a3bec389629814b9d7cddd" -> "c344e94d514a94d4b1284c134db82386"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "34ce2e6aa65b17c016a0570308d9c65f" -> "a20a7c7d4a77ff424704b0916576b297"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "eda4efade95148e6644b9eceecd044eb" -> "5b224f426d80290ac108567b7ba50831"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "c22d31323703b7308aae73b99847dd98" -> "826f52dd2e9078caef3d00eab1cc199f"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "672de35b183817bfdb92c2e1ca95de90" -> "2d96cf49c74b25dce3241b4b5c04942f"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "18a92d61b9ec3c7d4cf12c28c4386604" -> "5fe0937339ebc26ac13fb2b2f5b9390a"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "0f5d91acc7fc5553bfbc6e83d6d00e9a" -> "5414efbc5d89da7d5358f73dc341f3d1"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "a3bc51877739d49d2e0157af6f92ba02" -> "8238156e884e0f2d392d0d0934e7259b"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "cb0fd139c64765c41fa593cbfb589d06" -> "9f28540869ccc0aa6e3b3092f3e045e4"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "ff1d1162fe95e5626d087bb63bc1ce4a" -> "30fa21e1f3c4c51d31fae99ae576d98a"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "4e4e6d62c404b064684a9c5011e0de96" -> "7a5541a5a1c13abe0e961b1d61bc348f"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "1f4ca343650024ac985816f649a28cc8" -> "fbd614caf0b3a1c71680b803365b6172"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "0b00dca6f0167479fb915a83f70414a3" -> "8c4513b8b76e1f506f2a67cfa6a21cdb"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "50949069be29b91f17efa33d2ebdb2c1" -> "39ac983e2f54f9a27f71b3da9bd97f64"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "8516959b92eaef8d9fd60e4a41ac8443" -> "f0384e7b189165bbd993ec351b9437dd"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "5b7dde43f9239429cdfce09e36f4d8d1" -> "2552f8d14aa3053ede4b3aa1ab197527"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "024e469dc1dc8b0a867ebff0ef6f4c8a" -> "58aa4696e919908b52743e09c7740693"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "a51907acafec757a5ffeed64f4850503" -> "f78602db7a1edbd3836ba7efce8bb7f2"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "5d5017c1bac52e7aa7ce0243d4192225" -> "d1f2b5abb7bd70d30c02d0937f85960b"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "ad7763c850b2b27dcdb8994f4db3c2fd" -> "ef079ea82544c01889241224297cd14d"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "b404d216a96dfa491a8e4460c49aec73" -> "8d8f0474746a8c2316b997ae236e79f3"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "48fc0ad6051631879c8fd147319127fe" -> "fc94965b03c589caaf2cf7a6a53143c4"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "359feec3596f19966b522080bc65dee2" -> "173ab83229b1f4373bf48fbfbde6c81e"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "3c47690ce81429ab52941fb6b5da7fb8" -> "7969de218947a68cd966bbe4891e88e8"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "bbc80b386567713ee8cfba112ed0f061" -> "240abe70db5ae31bfb8fc054ec4063c5"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "da780d1d8903b308ffde2bd04738f783" -> "a9ef2fd053aa045e32700500d0ec177e"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "5640bc093f9bf7d027ab5b475abc66c2" -> "176ab3b1e06fbb181414fdfca28a05de"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "5394eba90e8447d6e0654983504a3557" -> "4d1ff52d0ca4643c636ad558435f17e1"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "f23fe6b3f6985ccdfec0c1addfcd9ea8" -> "a1f1bc8a7c27edbbb0ddcd263f94385d"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "0563238b88fe83507e8bd9872a5afd7a" -> "2f459a970d3c0b15d8714efa123ca442"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "6f5a3823cb67286822c6dd26520b829f" -> "368054ca9e21a51d782549d8bae47316"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0c508ec6183a86e1a58901e907bcb09d" -> "a83b1d0aadb2ef919cdd97dd34d73def"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "f7999e4f441e691847e64be03eb075a2" -> "5ef0c0f155ab799590e2de3532fd3dde"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "141c7ab27674b684adc3401299566972" -> "a09dbef4b26e2412ef9f98aca0ecb92f"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ce4790f6e5fecfabb17c305a68b3d0b7" -> "6ce722a00e251a71108c6acde919bddf"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "829984809d89460903c7715164ad1673" -> "cc7f2ba6eed32fbaf880f3affe6b232a"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "1c0e01df16832636e0cd5067f7a2b59d" -> "71297f1d882b1c277cbbbd681faa933f"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "d7d666d53a8f65dde652993c20072fe3" -> "5c12c60a5de95ae64039c11be9c726f2"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "0db86a5d1b9b05085884e0c1354490a2" -> "86886a849843b8de3be0d92ed16fb243"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "21efe4d87165698ba05c2051a5fe6f3a" -> "d370f27c5dbd320dbadae32247c0e9ec"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "1ffa3dc07f762bdac1c65d5b98964629" -> "ce4d9282d052b8e83d05f9e5f42a5cfd"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "b9e44e956d708d16ce4d4bba087e1150" -> "a66c9986c9e5671d61382168a5a6cc0c"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "a4936546b8448dfa79a084ff8d8ec3e2" -> "cc5d374032547bf6a0d6f745abfd899a"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "ogeVPKjLMIE3KVdQTJTAbMQo6BT0KYhk+B1EG0kGiMo=" -> "ucAPLH9P+LuRHWaONUXdoUSSIj7VEDOgGA1R34t8xmM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "F3KusV6mZYI8ompMTmFtO+JGkV+EFOeccI0rCdkV3k0=" -> "0E2s1z1G4TMw6dLFv93gXklFHSB8elMJXynEKriqRKM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "7B5tbO6/tUIC4/twEF70iixkSdiamIBmTlv0cnLxnMk=" -> "fEJ9DMnkPNH7f0dQg7eWtxB7G1lM0I40F5U9daAlD10="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "7LPqg4P9GhawlmUyxH7renxYL3M1JjzKsYi80LNWFe4=" -> "ZBXAifnkkAs/Lj4mX+WIWwjHBoYH0s8ejXk+/5RocW4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "R/iZtARrKNgciYucsB2ggTKoswEQOFiuA1KppdrKmwQ=" -> "Esvx48rVVWs8yGYtimR8JcAMyk4oDqmkEAoR3CRyTdo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "wQQ0qGVMveOd/PHRHEZIOPdPbq+JkGRnc6wpV7+Tyf4=" -> "9c8gRkold+5dqLwfHj4wiN8/Y2cLR0cINrMWSz047DY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "ULHqIETczkJcm/4zwRSWZZuuQirAHmmT5v/0REbvslE=" -> "jscXrPrr78mM12Ms1oZX0e2lUh7osGStgdaSdpUSIwo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "aDnlveQ/mI4haOIfF78jErUfpTFMOmUegA5AcSYKwsM=" -> "VvOl3HVNVLlVlsHSN+VJq0CyFFZOoK/MnigkU17xP2Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "/lCyZ5l+m7+EkemcQIfwh/DKszO5YpSLb+2BWM3EPqs=" -> "fxhW1/0AMpCRsUOPBcuRek1bSXcJP2jLfTXtXDFgpaI="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "4NMz21+mmMqFG0BHpM/e6V8B9D1h0sDFOj21PBr6Rjk=" -> "cAYU9THbRUHZHZ7vM8wQ8+Nkg9FnJMtlIsCIXHY2kSs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zue141fBrmJpKscs8UnCDyccZ8eLfNQ4a5qTGBccy04=" -> "jViOc9uUL6qPcXe+667sKh0gZovIp3Hp2Y+nGgB67tI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "QR02wu1KaKDmiYJ1VB+Ne3oM261QDkecYes7Fv0UQcY=" -> "qVp9yBbMRcUKU7M8mbHZjyrbFp5RbOKlfrXMFL1xEIA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "QiOJw6KujVgmk0ySmekCqDbfhjGrhvZGR9m0In1TI4Q=" -> "Y4yUHB+yDa3IxQTsIVnm63rzQuIEMyt89qqXh8H0kKM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "eZ8HCKVD8oQ4AnhdAYTpmb9xU1FyFvJm/+/pQ5moUz4=" -> "Qfc4k4jgVqYoGzkeVo6NFM0vitN4lwlX/wfR1FoGdoE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "QWYc+xPGmPyrqgSwTDg9LIR1qwFXIiAeXfvLP2WoGPg=" -> "BTwSSfYs8x7oXgPaPUy+no7kgIQ8HvFxN4ebo+GiL1s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "hb7EABrUBJS3Ica1uJPVFdE01gQ+NTUsJWKg+qKAets=" -> "35j8mLBGtgyIr/vkzK/8bSAJhO+M+PH6NSffRkh6wLY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "dqYDJn8S4CRDex1AKyiPF6DU0A8FNgyteSDmlHnO3sk=" -> "q6aHoGyusVDKLenLZ6CxtCquSMyckCUohxBZYUYnVVs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "kqtVx4UOen/McqfXhEjDqMcT39B1C/LFpK0pXhimMaY=" -> "tiFNsKdWIzX7ToYCEd9HwNMXyqc6aI7158sSHXVJxZo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "NQ12m2qRajvW2xEJY0XPKTde4AJ30T12dMqOGhCAmko=" -> "DfZ70G2prd2Io7pvRqF3fL2uqo40IE21Q+GKAhbLahc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "O5flSgV8Btl8XrGHSVX1shrppdUMnETqfegU1UIQ80I=" -> "YCfK9yrHrz4lgO0VTVqtA36r7NXXFvLe9zWhkKJzWjI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "2WJH0AJ7+lgcEhJlRyZB1JgHa2OrVs3iKsNroaWYoWs=" -> "wVaVd9wD34tGExDFGrTEtFTYedJgUR3mMOzddESLddk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "XjTl6dRYyuQvSCzydBp6dHRnDzW3zIChu3JxffJsIEA=" -> "pmBxO7JXGVhyImS1YC591ECQzMELA3ARV06ZyUlapik="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "1DRYIo9HrZpz/zuVk2JDjrjEa+xE5HnifTr0Jut06D0=" -> "43Ks6c+FZoQDFEThKqRcKT5KUADrZ1NlOAizafvLOpY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "zufX8/+4JEmUJrYD43CaFbI61tZOTOKzFBHQL5C8Mz8=" -> "iiNgdwENPmXzJPsGWPAO/ilqepI1ggVqvTaVJ454ris="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "xuq8UONQ18aXVu0sphlRHxa0S7Uu/iybToAjByzN40w=" -> "oz3SUe4DW892jvBE/vF66NSTu+aqB0h2n1LJZdF1MUw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr353YdNO2JqkR7HfFCUz2PRcgIYg/nUz9e2GF1Nrsw=" -> "idCWbDqSc8DEy2xKNQNqfW0j99RXVtdQA3h9bS3DdQI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "qvhh+qJQF7426aglqpfMSRf+iGUwkp6GTUHNiFi2uhE=" -> "YqtdBLH8kWjB2sN+OipC+R4rCU7mX67Ik74Gm6D/Bpk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "CAuPCjmOWNJxw5uk0V8EavEgujBbxIYvLc6d8BB7t9k=" -> "D5o5lgrQdZ0jfcsDhAwyT6oc4AXdJAEQ4etcUZ6fBGU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "L5VCUyTAe+6/Zt2fvzwt6wRTPK+8llpu3+YNMyklAbU=" -> "8VIRS2N0tocqKzBg/muhmqK7Vt3/Rldg1Vmmzjl2IQo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "oVQo5fycrXLccPzmAcEUEVnWtVfuDo5Ykbi3GeSHnHc=" -> "hAL/eLwZOGL0+CCsove2X9NvYafMqt+TzLe/u5AjnOk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "1eeNwzwrAFU9/uuV7jpnjwDhtEVLxlWGP9R9+AnZ3T0=" -> "Hrm+oE5nVfEiydZ9uHK6lACooT4e2PyyW70Rp/8vpbg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "Sinf2RwScXPFXizCLcUhaPbBayGVezZqMWKO2fgAOGQ=" -> "3XvXRaPTWnFu5EiYUvvnzENZt0N4CZUuJb/EgYCdtmk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-25T19:20:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "uRhUxcEWgaBge61SK8m6MbiGmxb0hNXB01zvAv/tlmU=" -> "t3qBMbe+0BjeCy08yo+RGVFPXyyy8sceWLQR0dUujOk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "MfsQmywXjDZw3ozGgSzc5dlxaMZ+a63d2+mg5rQzzak=" -> "0/lExRNVBpCD82uvBqTTWSVjJ7YGvxqkuPDeawjnMwQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "/BogZEgfy2MnLuXio/HCsH7I+Fxc+VO+QGDpRjzWnHM=" -> "2/0zZGIraj0p2fqj6dYUC+Ve0qUJ27VdDWwmxeoAbAo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "+ItvU4xCWv1spQioWzBhMh5SxsgbcgndD42ROepXD2k=" -> "nj3W8Fay39rEboEofVaU26FMU2fDmdu35AAQ1RG3Qlw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "uhcw3fCIPvJw2sZZfftkdq1t5jtOHtNCRtGE8iV1oHQ=" -> "aGUYUOYAN31DuA4VqlgFiHPtC2fXZZdT8Kk5a1nIggQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "GyVLtf5MmK9M0PggBl/e3/WZ0RVc7eStld8FXK9mnVA=" -> "B65LXxEM9R1gXdVlSreDT8G+xGPOTtWonvCvw3OPplY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "NbvDSgxQxQMWfFN8AB/2NLEgsoIQGxukYaPn+na6O38=" -> "VNlpweFzDtGi6/8lpOFQCt6C5uywZrs0yMPn2gbefNc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "SrWnGiK6Ld5PNgXrCp+llwdKdfjFUbjCHtPmU1cevVY=" -> "kgQ4P0s5Szm0Plc0J/wVX/a1V1zecQicFYz6MpW0aKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "7EkBCrL3KqOB1ETLWf60fGHHdTaIkKzJ9Wn4uywfbJU=" -> "mADvsH00E2Zjm5SLUwEF2mFQWic7WnKl3vZdTmAKtLQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "fdM2S065xKmnFDQ01K3qkBdFnYBSo1CMa12iBFO00lc=" -> "gQoAAcAlCRPpNlQJEPDkQPy+C4HuiFkdo5sdud72Q50="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "e3cwElhmDW3/CVHUVvECkAhQfUksAP1Ig32CGYnfnHc=" -> "GMnkuLaP0flgNqGWesrB2G6qi3M7+HE7n17Rq2c1+3w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "CV16FEW+mnIvUj7Vs5rbYx+2HvthUDOHj7PllxrTPHQ=" -> "tgeM/f4pfAY+xxmlPTVIq5G0bopc6YS+0HO9xdhMDeQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-23T21:20:16Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "pqeo5a" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-23T21:20:15Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-23T21:20:15Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*